Masmiseim36/nxpSDK/devices/MKE15Z4/drivers/fsl_lpuart.c
    return status;
}

/*!
 * brief Writes to the transmitter register using a blocking method.
 *
 * This function polls the transmitter register, waits for the register to be empty or  for TX FIFO to have
 * room, and writes data to the transmitter buffer.
 *
 * note This function does not check whether all data has been sent out to the bus.
 * Before disabling the transmitter, check the kLPUART_TransmissionCompleteFlag to ensure that the transmit is
 * finished.
 *
 * param base LPUART peripheral base address.
 * param data Start address of the data to write.
 * param length Size of the data to write.
 */
void LPUART_WriteBlocking(LPUART_Type *base, const uint8_t *data, size_t length)
{
    assert(data);

    const uint8_t *dataAddress = data;
    size_t transferSize = length;

    /* This API can only ensure that the data is written into the data buffer but can't
    ensure all data in the data buffer are sent into the transmit shift buffer. */
    while (0U != transferSize)
    {
        while (!(base->STAT & LPUART_STAT_TDRE_MASK))
        {
        }
        base->DATA = *(dataAddress);
        dataAddress++;
        transferSize--;
    }
}

/*!
* brief Reads the receiver data register using a blocking method.
 *
 * This function polls the receiver register, waits for the receiver register full or receiver FIFO
 * has data, and reads data from the TX register.
 *
 * param base LPUART peripheral base address.
 * param data Start address of the buffer to store the received data.
 * param length Size of the buffer.
 * retval kStatus_LPUART_RxHardwareOverrun Receiver overrun happened while receiving data.
 * retval kStatus_LPUART_NoiseError Noise error happened while receiving data.
 * retval kStatus_LPUART_FramingError Framing error happened while receiving data.
 * retval kStatus_LPUART_ParityError Parity error happened while receiving data.
 * retval kStatus_Success Successfully received all data.
 */
status_t LPUART_ReadBlocking(LPUART_Type *base, uint8_t *data, size_t length)
{
    assert(data);

    int32_t statusFlag;
    uint8_t *dataAddress = data;

#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
    uint32_t ctrl = base->CTRL;
    bool isSevenDataBits =
        ((ctrl & LPUART_CTRL_M7_MASK) || ((!(ctrl & LPUART_CTRL_M_MASK)) && (ctrl & LPUART_CTRL_PE_MASK)));
#endif

    while (0U != (length--))
    {
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        while (0 == ((base->WATER & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT))
#else
        while (!(base->STAT & LPUART_STAT_RDRF_MASK))
#endif
        {
            statusFlag = (int32_t)LPUART_GetStatusFlags(base);

            if (kLPUART_RxOverrunFlag == (statusFlag & kLPUART_RxOverrunFlag))
            {
                return ((kStatus_Success == LPUART_ClearStatusFlags(base, kLPUART_RxOverrunFlag)) ?
                            (kStatus_LPUART_RxHardwareOverrun) :
                            (kStatus_LPUART_FlagCannotClearManually));
            }

            if (kLPUART_NoiseErrorFlag == (statusFlag & kLPUART_NoiseErrorFlag))
            {
                return ((kStatus_Success == LPUART_ClearStatusFlags(base, kLPUART_NoiseErrorFlag)) ?
                            (kStatus_LPUART_NoiseError) :
                            (kStatus_LPUART_FlagCannotClearManually));
            }

            if (kLPUART_FramingErrorFlag == (statusFlag & kLPUART_FramingErrorFlag))
            {
                return ((kStatus_Success == LPUART_ClearStatusFlags(base, kLPUART_FramingErrorFlag)) ?
                            (kStatus_LPUART_FramingError) :
                            (kStatus_LPUART_FlagCannotClearManually));
            }

            if (kLPUART_ParityErrorFlag == (statusFlag & kLPUART_ParityErrorFlag))
            {
                return ((kStatus_Success == LPUART_ClearStatusFlags(base, kLPUART_ParityErrorFlag)) ?
                            (kStatus_LPUART_ParityError) :
                            (kStatus_LPUART_FlagCannotClearManually));
            }
        }
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
        if (isSevenDataBits)
        {
            *(dataAddress) = (uint8_t)(base->DATA & 0x7F);
            dataAddress++;
        }
        else
        {
            *(dataAddress) = (uint8_t)base->DATA;
            dataAddress++;
        }
#else
        *(dataAddress) = (uint8_t)base->DATA;
        dataAddress++;
#endif
    }

    return kStatus_Success;
}

/*!
 * brief Initializes the LPUART handle.
 *
 * This function initializes the LPUART handle, which can be used for other LPUART
 * transactional APIs. Usually, for a specified LPUART instance,
 * call this API once to get the initialized handle.
 *
 * The LPUART driver supports the "background" receiving, which means that user can set up
 * an RX ring buffer optionally. Data received is stored into the ring buffer even when the
 * user doesn't call the LPUART_TransferReceiveNonBlocking() API. If there is already data received
 * in the ring buffer, the user can get the received data from the ring buffer directly.
 * The ring buffer is disabled if passing NULL as p ringBuffer.
 *
 * param base LPUART peripheral base address.
 * param handle LPUART handle pointer.
 * param callback Callback function.
 * param userData User data.
 */
void LPUART_TransferCreateHandle(LPUART_Type *base,
                                 lpuart_handle_t *handle,
                                 lpuart_transfer_callback_t callback,
                                 void *userData)
{
    assert(handle);

    uint32_t instance;

#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
    uint32_t ctrl = base->CTRL;
    bool isSevenDataBits =
        ((ctrl & LPUART_CTRL_M7_MASK) || ((!(ctrl & LPUART_CTRL_M_MASK)) && (ctrl & LPUART_CTRL_PE_MASK)));
#endif

    /* Zero the handle. */
    (void)memset(handle, 0, sizeof(lpuart_handle_t));

    /* Set the TX/RX state. */
    handle->rxState = kLPUART_RxIdle;
    handle->txState = kLPUART_TxIdle;

